In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import psycopg2
import os
from sklearn import datasets
import numpy as np
import seaborn as sns

### Importing datasets and creating new tables in postgresql

In [2]:
os.listdir()

['nycflights13_planes.csv.gz',
 'nycflights13_weather.csv.gz',
 '.ipynb_checkpoints',
 'ml-1m',
 'nycflights13_airlines.csv.gz',
 'nycflights13_flights.csv.gz',
 'nycflights13_airports.csv.gz',
 'Pandas - Exercises.ipynb']

In [3]:
planes = pd.read_csv('nycflights13_planes.csv.gz', comment='#', compression='gzip')
weather = pd.read_csv('nycflights13_weather.csv.gz', comment='#', compression='gzip')
airlines = pd.read_csv('nycflights13_airlines.csv.gz', comment='#', compression='gzip')
flights = pd.read_csv('nycflights13_flights.csv.gz', comment='#', compression='gzip')
airports = pd.read_csv('nycflights13_airports.csv.gz', comment='#', compression='gzip')

In [4]:
engine = create_engine('postgresql+psycopg2://postgres:[password]@localhost:5432/postgres')

In [5]:
engine.table_names()

['test',
 'flats_warsaw',
 'planes',
 'weather',
 'airlines',
 'flights',
 'errors',
 'airports']

In [6]:
con = engine.connect()

In [7]:
con.closed

False

In [8]:
#planes.to_sql('planes', con, if_exists='fail')
#weather.to_sql('weather', con, if_exists='fail')
#airlines.to_sql('airlines', con, if_exists='fail')
#flights.to_sql('flights', con, if_exists='fail')
#airports.to_sql('airports', con, if_exists='fail')

### 2.1 Ramka danych flights zawiera kolumny year i month. Wygeneruj na ich podstawie nową zmienną typu data i czas.

In [9]:
flights.head()

,Unnamed: 0,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,1,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,3,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,4,2013,1,1,544.0,-1.0,1004.0,-18.0,B6,N804JB,725,JFK,BQN,183.0,1576,5.0,44.0
4,5,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0

In [10]:
pd.to_datetime({'year': flights['year'], 
                'month': flights['month'], 
                'day': flights["day"]})

0        2013-01-01
1        2013-01-01
2        2013-01-01
3        2013-01-01
4        2013-01-01
5        2013-01-01
6        2013-01-01
7        2013-01-01
8        2013-01-01
9        2013-01-01
10       2013-01-01
11       2013-01-01
12       2013-01-01
13       2013-01-01
14       2013-01-01
15       2013-01-01
16       2013-01-01
17       2013-01-01
18       2013-01-01
19       2013-01-01
20       2013-01-01
21       2013-01-01
22       2013-01-01
23       2013-01-01
24       2013-01-01
25       2013-01-01
26       2013-01-01
27       2013-01-01
28       2013-01-01
29       2013-01-01
            ...
336746   2013-09-30
336747   2013-09-30
336748   2013-09-30
336749   2013-09-30
336750   2013-09-30
336751   2013-09-30
336752   2013-09-30
336753   2013-09-30
336754   2013-09-30
336755   2013-09-30
336756   2013-09-30
336757   2013-09-30
336758   2013-09-30
336759   2013-09-30
336760   2013-09-30
336761   2013-09-30
336762   2013-09-30
336763   2013-09-30
336764   2013-09-30
336765   2013-09-30
336766   2013-09-30
336767   2013-09-30
336768   2013-09-30
336769   2013-09-30
336770   2013-09-30
336771   2013-09-30
336772   2013-09-30
336773   2013-09-30
336774   2013-09-30
336775   2013-09-30
Length: 336776, dtype: datetime64[ns]

### 2.3 Podziel ramkę danych iris na dwie rozłączne części: niech pierwszazawiera 80% obserwacji, a druga - pozostałe 20%. (podpowiedź: sample albo permutation)

In [11]:
iris = datasets.load_iris()

In [12]:
type(iris)

sklearn.utils.Bunch

In [13]:
data1 = pd.DataFrame(data= np.c_[iris['data'], iris['target']],
                     columns= iris['feature_names'] + ['target'])

In [14]:
data1.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0.0
1,4.9,3.0,1.4,0.2,0.0
2,4.7,3.2,1.3,0.2,0.0
3,4.6,3.1,1.5,0.2,0.0
4,5.0,3.6,1.4,0.2,0.0

In [15]:
train = data1.sample(frac=0.8, random_state=200)
test = data1.drop(train.index)

### 2.4 Dokonaj standaryzacji wszystkich zmiennych liczbowych w ramce danych iris (odejmij średnią i podziel przez odchylenie standardowe).

In [16]:
(data1 - data1.mean()) / data1.std()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,-0.897674,1.028611,-1.336794,-1.308593,-1.220656
1,-1.139200,-0.124540,-1.336794,-1.308593,-1.220656
2,-1.380727,0.336720,-1.393470,-1.308593,-1.220656
3,-1.501490,0.106090,-1.280118,-1.308593,-1.220656
4,-1.018437,1.259242,-1.336794,-1.308593,-1.220656
5,-0.535384,1.951133,-1.166767,-1.046525,-1.220656
6,-1.501490,0.797981,-1.336794,-1.177559,-1.220656
7,-1.018437,0.797981,-1.280118,-1.308593,-1.220656
8,-1.743017,-0.355171,-1.336794,-1.308593,-1.220656
9,-1.139200,0.106090,-1.280118,-1.439627,-1.220656
10,-0.535384,1.489872,-1.280118,-1.308593,-1.220656
11,-1.259964,0.797981,-1.223442,-1.308593,-1.220656
12,-1.259964,-0.124540,-1.336794,-1.439627,-1.220656
13,-1.863780,-0.124540,-1.506822,-1.439627,-1.220656
14,-0.052331,2.181763,-1.450146,-1.308593,-1.220656
15,-0.173094,3.104284,-1.280118,-1.046525,-1.220656
16,-0.535384,1.951133,-1.393470,-1.046525,-1.220656
17,-0.897674,1.028611,-1.336794,-1.177559,-1.220656
18,-0.173094,1.720502,-1.166767,-1.177559,-1.220656
19,-0.897674,1.720502,-1.280118,-1.177559,-1.220656
20,-0.535384,0.797981,-1.166767,-1.308593,-1.220656
21,-0.897674,1.489872,-1.280118,-1.046525,-1.220656
22,-1.501490,1.259242,-1.563497,-1.308593,-1.220656
23,-0.897674,0.567351,-1.166767,-0.915491,-1.220656
24,-1.259964,0.797981,-1.053415,-1.308593,-1.220656
25,-1.018437,-0.124540,-1.223442,-1.308593,-1.220656
26,-1.018437,0.797981,-1.223442,-1.046525,-1.220656
27,-0.776911,1.028611,-1.280118,-1.308593,-1.220656
28,-0.776911,0.797981,-1.336794,-1.308593,-1.220656
29,-1.380727,0.336720,-1.223442,-1.308593,-1.220656
...,...,...,...,...,...
120,1.276066,0.336720,1.100267,1.443121,1.220656
121,-0.293857,-0.585801,0.646860,1.050019,1.220656
122,2.242172,-0.585801,1.667025,1.050019,1.220656
123,0.551486,-0.816431,0.646860,0.787951,1.220656
124,1.034539,0.567351,1.100267,1.181053,1.220656
125,1.638355,0.336720,1.270294,0.787951,1.220656
126,0.430722,-0.585801,0.590184,0.787951,1.220656
127,0.309959,-0.124540,0.646860,0.787951,1.220656
128,0.672249,-0.585801,1.043591,1.181053,1.220656
129,1.638355,-0.124540,1.156943,0.525883,1.220656
130,1.879882,-0.585801,1.326970,0.918985,1.220656
131,2.483699,1.720502,1.496998,1.050019,1.220656
132,0.672249,-0.585801,1.043591,1.312087,1.220656
133,0.551486,-0.585801,0.760212,0.394849,1.220656
134,0.309959,-1.047062,1.043591,0.263815,1.220656
135,2.242172,-0.124540,1.326970,1.443121,1.220656
136,0.551486,0.797981,1.043591,1.574155,1.220656
137,0.672249,0.106090,0.986915,0.787951,1.220656
138,0.189196,-0.124540,0.590184,0.787951,1.220656
139,1.276066,0.106090,0.930239,1.181053,1.220656
140,1.034539,0.106090,1.043591,1.574155,1.220656
141,1.276066,0.106090,0.760212,1.443121,1.220656
142,-0.052331,-0.816431,0.760212,0.918985,1.220656
143,1.155302,0.336720,1.213619,1.443121,1.220656
144,1.034539,0.567351,1.100267,1.705189,1.220656
145,1.034539,-0.124540,0.816888,1.443121,1.220656
146,0.551486,-1.277692,0.703536,0.918985,1.220656
147,0.793012,-0.124540,0.816888,1.050019,1.220656
148,0.430722,0.797981,0.930239,1.443121,1.220656
149,0.068433,-0.124540,0.760212,0.787951,1.220656

### 2.5 Utwórz tabelę przestawną (pivot table) dla ramki tips, dla wartości total_bill i tip, w rozbiciu na dzień tygodnia oraz płeć. Funkcją agregującą niech będzie mediana.

In [17]:
tips = sns.load_dataset("tips")

In [18]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
pd.pivot_table(tips, index=["day"], columns=["sex"], values=["total_bill", "tip"], aggfunc=["median"])

     median
        tip        total_bill
sex    Male Female       Male  Female
day
Sun   3.085  3.500     20.725  17.410
Sat   3.000  2.625     18.240  18.360
Thur  2.530  2.005     16.975  13.785
Fri   2.600  3.000     17.215  15.380

In [20]:
pd.pivot_table(tips, index=["sex"], values=["tip", "total_bill"], aggfunc=["mean", "sum"])

            mean                sum
             tip total_bill     tip total_bill
sex
Female  2.833448  18.056897  246.51    1570.95
Male    3.089618  20.744076  485.07    3256.82

### 2.6 Utwórz tablicę kontyngencji dla kombinacji zmiennych tips.smoker, tip.sex, tips.day.

In [21]:
pd.crosstab(tips.smoker, [tips.sex, tips.day])

sex    Male             Female
day    Thur Fri Sat Sun   Thur Fri Sat Sun
smoker
No       20   2  32  43     25   2  13  14
Yes      10   8  27  15      7   7  15   4

### 2.7 Oblicz, jaką część rachunku stanowi napiwek i podaj podsumowania liczbowe tych wartości (także w podgrupach utworzonych na podstawie zmiennych jakościowych dostępnych w ramce danych tips)

In [22]:
tips["tips_share"] = tips["tip"] / tips["total_bill"]

In [23]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tips_share
0       16.99  1.01  Female     No  Sun  Dinner     2    0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3    0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3    0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2    0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4    0.146808

In [24]:
pd.pivot_table(tips, index="sex", values="tips_share", aggfunc="mean")

        tips_share
sex
Female    0.166491
Male      0.157651

In [25]:
pd.pivot_table(tips, index="day", values="tips_share", aggfunc="mean")

      tips_share
day
Sun     0.166897
Sat     0.153152
Thur    0.161276
Fri     0.169913

In [26]:
pd.pivot_table(tips, index="time", values="tips_share", aggfunc="mean")

        tips_share
time
Dinner    0.159518
Lunch     0.164128

In [27]:
pd.pivot_table(tips, index="size", values="tips_share", aggfunc="mean")

      tips_share
size
1       0.217292
2       0.165719
3       0.152157
4       0.145949
5       0.141495
6       0.156229

### 2.8 Wyznacz podstawowe statystyki próbkowe (średnia, odchylenie standardowe, kwartyle) dla dystansu (ramka danych flights) w każdym roku z osobna. Przedstaw wyniki tak, by zagregowane wartości przechowywane były w kolumnach, a kolejne lata - w wierszach.

In [28]:
flights.head()

,Unnamed: 0,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,1,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,3,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,4,2013,1,1,544.0,-1.0,1004.0,-18.0,B6,N804JB,725,JFK,BQN,183.0,1576,5.0,44.0
4,5,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0

In [29]:
pd.pivot_table(flights, index=["month"], 
               values=["distance"], 
               aggfunc=["mean", "std","quantile"])

              mean         std quantile
          distance    distance distance
month
1      1006.843616  719.048480    872.0
2      1000.982285  710.972287    872.0
3      1011.987099  705.151350    888.0
4      1038.732580  725.363275    888.0
5      1040.912905  742.266020    820.0
6      1057.125235  748.927897    872.0
7      1058.596398  747.650396    872.0
8      1062.138439  750.882610    872.0
9      1041.249946  745.768324    764.0
10     1038.875904  735.414314    812.0
11     1050.305046  730.933290    888.0
12     1064.655554  727.435811    944.0

## 2.10 
## Zadanie polega na wykonaniu z użyciem biblioteki Pandas operacji na ramkach danych, które dadzą nam wyniki analogiczne do następujących komand SQL. Wynikiem powinna być zawsze ramka danych.

### 1

In [30]:
query = 'SELECT DISTINCT engine FROM planes'
sql_query = pd.read_sql(query, con)
sql_query.head()

          engine
0     Turbo-prop
1      Turbo-fan
2  Reciprocating
3      Turbo-jet
4        4 Cycle

In [31]:
result = pd.DataFrame(planes["engine"].unique()).rename({0: "engine"}, axis=1)
result.head()

          engine
0      Turbo-fan
1      Turbo-jet
2  Reciprocating
3        4 Cycle
4    Turbo-shaft

### 2

In [32]:
query = 'SELECT DISTINCT type, manufacturer, model, seats, engine FROM planes'
sql_query = pd.read_sql(query, con)
sql_query.head()

,type,manufacturer,model,seats,engine
0,Fixed wing single engine,AMERICAN AIRCRAFT INC,FALCON XP,2,Reciprocating
1,Fixed wing multi engine,BOEING,717-200,100,Turbo-fan
2,Fixed wing multi engine,AIRBUS INDUSTRIE,A319-131,179,Turbo-jet
3,Rotorcraft,AGUSTA SPA,A109E,8,Turbo-shaft
4,Fixed wing multi engine,MCDONNELL DOUGLAS,DC-9-82(MD-82),172,Turbo-fan

In [33]:
sql_query.shape

(149, 5)

In [34]:
result = planes[["type", "manufacturer", "model", "seats", "engine"]].drop_duplicates().reset_index(drop=True)
result.head()

                      type      manufacturer      model  seats     engine
0  Fixed wing multi engine           EMBRAER  EMB-145XR     55  Turbo-fan
1  Fixed wing multi engine  AIRBUS INDUSTRIE   A320-214    182  Turbo-fan
2  Fixed wing multi engine           EMBRAER  EMB-145LR     55  Turbo-fan
3  Fixed wing multi engine            BOEING    737-824    149  Turbo-fan
4  Fixed wing multi engine            BOEING    767-332    330  Turbo-fan

In [35]:
result.shape

(149, 5)

### 3

In [36]:
query = 'SELECT COUNT(*), engine FROM planes GROUP BY engine'
sql_query = pd.read_sql(query, con)
sql_query.head()

   count         engine
0      2     Turbo-prop
1   2750      Turbo-fan
2     28  Reciprocating
3    535      Turbo-jet
4      2        4 Cycle

In [37]:
sql_query.shape

(6, 2)

In [38]:
result = planes.groupby("engine").count().reset_index()[["engines", "engine"]]\
        .rename({"engines": "count"}, axis=1)
result.head()

   count         engine
0      2        4 Cycle
1     28  Reciprocating
2   2750      Turbo-fan
3    535      Turbo-jet
4      2     Turbo-prop

In [39]:
result = planes["engine"].value_counts().reset_index()[["engine", "index"]]\
        .rename({"engine": "count", "index": "engine"}, axis=1)
result.head()

   count         engine
0   2750      Turbo-fan
1    535      Turbo-jet
2     28  Reciprocating
3      5    Turbo-shaft
4      2     Turbo-prop

In [40]:
result.shape

(6, 2)

### 4

In [41]:
query = 'SELECT COUNT(*), engine, type FROM planes GROUP BY engine, type'
sql_query = pd.read_sql(query, con)
sql_query.head()

   count         engine                      type
0      5  Reciprocating   Fixed wing multi engine
1    535      Turbo-jet   Fixed wing multi engine
2     23  Reciprocating  Fixed wing single engine
3      2        4 Cycle  Fixed wing single engine
4      2     Turbo-prop   Fixed wing multi engine

In [42]:
result = pd.pivot_table(planes[["engine", "type"]], 
                        index="engine",
                        columns="type",
                        aggfunc="size").stack().reset_index()\
                        .rename({0: "count"}, axis=1)[["count","engine","type"]]
result["count"] = result["count"].astype(int) 
result = result.sort_values(by="engine")
result.head()

   count         engine                      type
0      2        4 Cycle  Fixed wing single engine
1      5  Reciprocating   Fixed wing multi engine
2     23  Reciprocating  Fixed wing single engine
3   2750      Turbo-fan   Fixed wing multi engine
4    535      Turbo-jet   Fixed wing multi engine

In [43]:
result = pd.crosstab(planes["engine"], planes["type"]).stack().reset_index().rename({0: "count"}, axis=1)
result = result[result["count"] > 0][["count", "engine", "type"]].sort_values(by="engine")
result.head()

   count         engine                      type
1      2        4 Cycle  Fixed wing single engine
3      5  Reciprocating   Fixed wing multi engine
4     23  Reciprocating  Fixed wing single engine
6   2750      Turbo-fan   Fixed wing multi engine
9    535      Turbo-jet   Fixed wing multi engine

In [44]:
result = planes.groupby(["engine", "type"]).size().reset_index().rename({0: "count"}, axis=1)\
        [["count", "engine", "type"]].sort_values(by="engine")

### 5

In [45]:
query = 'SELECT MIN(year), AVG(year), MAX(year), engine, manufacturer FROM planes GROUP BY engine, manufacturer'
sql_query = pd.read_sql(query, con)
sql_query.head()

      min     avg     max         engine          manufacturer
0  1976.0  1976.0  1976.0      Turbo-jet  GULFSTREAM AEROSPACE
1  1979.0  1979.0  1979.0      Turbo-fan                CESSNA
2  1985.0  1985.0  1985.0    Turbo-shaft              SIKORSKY
3     NaN     NaN     NaN      Turbo-fan           LEARJET INC
4  2007.0  2007.0  2007.0  Reciprocating    AVIAT AIRCRAFT INC

In [46]:
result = pd.pivot_table(planes[["engine", "manufacturer", "year"]], 
                        index=["engine", "manufacturer"], 
                        values=["year"], 
                        aggfunc=["min", "max", "mean"]).reset_index()
result[[("min", "year"), ("mean", "year"), ("max", "year"), ("engine", ""), ("manufacturer", "")]].head(10)

      min         mean     max         engine           manufacturer
     year         year    year
0  1975.0  1975.000000  1975.0        4 Cycle                 CESSNA
1     NaN          NaN     NaN        4 Cycle            JOHN G HESS
2     NaN          NaN     NaN  Reciprocating  AMERICAN AIRCRAFT INC
3  2007.0  2007.000000  2007.0  Reciprocating     AVIAT AIRCRAFT INC
4     NaN          NaN     NaN  Reciprocating          BARKER JACK L
5  1959.0  1971.142857  1983.0  Reciprocating                 CESSNA
6  2007.0  2007.000000  2007.0  Reciprocating     CIRRUS DESIGN CORP
7  1959.0  1959.000000  1959.0  Reciprocating            DEHAVILLAND
8  1956.0  1956.000000  1956.0  Reciprocating                DOUGLAS
9  2007.0  2007.000000  2007.0  Reciprocating         FRIEDEMANN JON

### 6

In [47]:
query = 'SELECT * FROM planes WHERE speed IS NOT NULL'
sql_query = pd.read_sql(query, con)
sql_query.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,424,N201AA,1959.0,Fixed wing single engine,CESSNA,150,1,2,90.0,Reciprocating
1,427,N202AA,1980.0,Fixed wing multi engine,CESSNA,421C,2,8,90.0,Reciprocating
2,821,N350AA,1980.0,Fixed wing multi engine,PIPER,PA-31-350,2,8,162.0,Reciprocating
3,893,N364AA,1973.0,Fixed wing multi engine,CESSNA,310Q,2,6,167.0,Reciprocating
4,1027,N378AA,1963.0,Fixed wing single engine,CESSNA,172E,1,4,105.0,Reciprocating

In [48]:
speed_na = pd.notnull(planes["speed"])
planes[speed_na].head().reset_index(drop=True)

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N201AA,1959.0,Fixed wing single engine,CESSNA,150,1,2,90.0,Reciprocating
1,N202AA,1980.0,Fixed wing multi engine,CESSNA,421C,2,8,90.0,Reciprocating
2,N350AA,1980.0,Fixed wing multi engine,PIPER,PA-31-350,2,8,162.0,Reciprocating
3,N364AA,1973.0,Fixed wing multi engine,CESSNA,310Q,2,6,167.0,Reciprocating
4,N378AA,1963.0,Fixed wing single engine,CESSNA,172E,1,4,105.0,Reciprocating

### 7

In [49]:
query = 'SELECT tailnum FROM planes WHERE year >= 2010'
sql_query = pd.read_sql(query, con)
sql_query.head()

  tailnum
0  N127UW
1  N128UW
2  N150UW
3  N151UW
4  N152UW

In [50]:
result = planes[planes["year"] >= 2010][["tailnum"]].reset_index(drop=True)

In [51]:
result.head()

  tailnum
0  N127UW
1  N128UW
2  N150UW
3  N151UW
4  N152UW

### 8

In [52]:
query = 'SELECT tailnum FROM planes WHERE seats BETWEEN 100 and 200 LIMIT 20'
sql_query = pd.read_sql(query, con)
sql_query.head()

  tailnum
0  N102UW
1  N103US
2  N104UW
3  N105UW
4  N107US

In [53]:
result = planes[(planes["seats"] > 100) & (planes["seats"] < 200)][["tailnum"]].reset_index(drop=True)
result.head()

  tailnum
0  N102UW
1  N103US
2  N104UW
3  N105UW
4  N107US

### 9

In [54]:
query = r"SELECT * FROM planes WHERE manufacturer IN ('BOEING', 'AIRBUS', 'EMBRAER')"
sql_query = pd.read_sql(query, con)
sql_query.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,None,Turbo-fan
1,4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,None,Turbo-fan
2,10,N11106,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,None,Turbo-fan
3,11,N11107,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,None,Turbo-fan
4,12,N11109,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,None,Turbo-fan

In [55]:
result = planes[planes["manufacturer"].isin(['BOEING', 'AIRBUS', 'EMBRAER'])].reset_index()
result.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan
2,10,N11106,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
3,11,N11107,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
4,12,N11109,2002.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan

### 10

In [56]:
query = r"SELECT * FROM planes WHERE manufacturer IN ('BOEING','AIRBUS','EMBRAER') AND seats > 300"
sql_query = pd.read_sql(query, con)
sql_query.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,49,N1200K,1998.0,Fixed wing multi engine,BOEING,767-332,2,330,None,Turbo-fan
1,50,N1201P,1998.0,Fixed wing multi engine,BOEING,767-332,2,330,None,Turbo-fan
2,69,N121DE,1987.0,Fixed wing multi engine,BOEING,767-332,2,330,None,Turbo-fan
3,117,N136DL,1991.0,Fixed wing multi engine,BOEING,767-332,2,330,None,Turbo-fan
4,122,N137DL,1991.0,Fixed wing multi engine,BOEING,767-332,2,330,None,Turbo-fan

In [57]:
result = planes[planes["manufacturer"].isin(['BOEING', 'AIRBUS', 'EMBRAER'])]
result = result[result["seats"] > 300].reset_index()
result.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,49,N1200K,1998.0,Fixed wing multi engine,BOEING,767-332,2,330,NaN,Turbo-fan
1,50,N1201P,1998.0,Fixed wing multi engine,BOEING,767-332,2,330,NaN,Turbo-fan
2,69,N121DE,1987.0,Fixed wing multi engine,BOEING,767-332,2,330,NaN,Turbo-fan
3,117,N136DL,1991.0,Fixed wing multi engine,BOEING,767-332,2,330,NaN,Turbo-fan
4,122,N137DL,1991.0,Fixed wing multi engine,BOEING,767-332,2,330,NaN,Turbo-fan

### 11

In [58]:
query = r"SELECT manufacturer, COUNT(*) FROM planes WHERE seats > 200 GROUP BY manufacturer"
sql_query = pd.read_sql(query, con)
sql_query.head()

       manufacturer  count
0  AIRBUS INDUSTRIE      4
1            AIRBUS     66
2            BOEING    225

In [59]:
result = planes[planes["seats"] > 200]
pd.pivot_table(result, index="manufacturer", aggfunc="size").reset_index().rename({0: "count"}, axis=1)\
    .sort_values(by="count").reset_index(drop=True)

       manufacturer  count
0  AIRBUS INDUSTRIE      4
1            AIRBUS     66
2            BOEING    225

### 12

In [60]:
query = r"SELECT manufacturer, COUNT(*) FROM planes GROUP BY manufacturer HAVING COUNT(*) > 10"
sql_query = pd.read_sql(query, con)
sql_query.head()

                    manufacturer  count
0              MCDONNELL DOUGLAS    120
1               AIRBUS INDUSTRIE    400
2  MCDONNELL DOUGLAS AIRCRAFT CO    103
3                         AIRBUS    336
4                        EMBRAER    299

In [61]:
result = planes[["manufacturer"]].groupby("manufacturer", as_index=False).size().reset_index()
result = result.rename({0: "count"}, axis=1)
result = result[result["count"] > 10].reset_index(drop=True)
result

                    manufacturer  count
0                         AIRBUS    336
1               AIRBUS INDUSTRIE    400
2                         BOEING   1630
3                 BOMBARDIER INC    368
4                        EMBRAER    299
5              MCDONNELL DOUGLAS    120
6  MCDONNELL DOUGLAS AIRCRAFT CO    103
7  MCDONNELL DOUGLAS CORPORATION     14

### 13

In [62]:
query = r"SELECT manufacturer, COUNT(*) FROM planes WHERE seats > 200 GROUP BY manufacturer HAVING COUNT(*) > 10"
sql_query = pd.read_sql(query, con)
sql_query.head()

  manufacturer  count
0       AIRBUS     66
1       BOEING    225

In [63]:
result = pd.pivot_table(planes[planes["seats"] > 200], index=["manufacturer"], aggfunc=["size"])
result = result[result["size"] > 10].rename({"size": "count"}, axis=1).reset_index()
result.head()

  manufacturer  count
0       AIRBUS     66
1       BOEING    225

### 14

In [64]:
query = r"SELECT manufacturer, COUNT(*) AS howmany FROM planes GROUP BY manufacturer ORDER BY howmany"
sql_query = pd.read_sql(query, con)
sql_query.head()

         manufacturer  howmany
0          AGUSTA SPA        1
1        KILDALL GARY        1
2          MARZ BARRY        1
3         JOHN G HESS        1
4  AVIAT AIRCRAFT INC        1

In [65]:
result = pd.pivot_table(planes, index=["manufacturer"], aggfunc=["size"]).sort_values(by="size")
result = result.reset_index().rename({"size": "howmany"}, axis=1)
result.head()

         manufacturer  howmany
0          AGUSTA SPA        1
1             DOUGLAS        1
2         DEHAVILLAND        1
3  CIRRUS DESIGN CORP        1
4  HURLEY JAMES LARRY        1

### 15

In [66]:
query = r"SELECT manufacturer, COUNT(*) AS howmany FROM planes GROUP BY manufacturer ORDER BY howmany DESC LIMIT 10"
sql_query = pd.read_sql(query, con)
sql_query.head()

       manufacturer  howmany
0            BOEING     1630
1  AIRBUS INDUSTRIE      400
2    BOMBARDIER INC      368
3            AIRBUS      336
4           EMBRAER      299

In [67]:
pd.pivot_table(planes[["manufacturer"]], 
               index=["manufacturer"], 
               aggfunc="size").reset_index().sort_values(by=0, ascending=False)[:10].reset_index(drop=True)

                    manufacturer     0
0                         BOEING  1630
1               AIRBUS INDUSTRIE   400
2                 BOMBARDIER INC   368
3                         AIRBUS   336
4                        EMBRAER   299
5              MCDONNELL DOUGLAS   120
6  MCDONNELL DOUGLAS AIRCRAFT CO   103
7  MCDONNELL DOUGLAS CORPORATION    14
8                         CESSNA     9
9                       CANADAIR     9

### 16

In [68]:
query = r"SELECT * FROM planes WHERE year >= 2012 ORDER BY year,seats"
sql_query = pd.read_sql(query, con)
sql_query.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,1564,N537JB,2012.0,Rotorcraft,ROBINSON HELICOPTER CO,R66,1,5,None,Turbo-shaft
1,825,N351JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
2,837,N353JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
3,815,N348JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
4,2782,N8603F,2012.0,Fixed wing multi engine,BOEING,737-8H4,2,140,None,Turbo-fan

In [69]:
result = planes[planes["year"] >= 2012].sort_values(by=["year", "seats"]).reset_index()
result.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,1564,N537JB,2012.0,Rotorcraft,ROBINSON HELICOPTER CO,R66,1,5,NaN,Turbo-shaft
1,815,N348JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
2,825,N351JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
3,837,N353JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
4,2630,N8301J,2012.0,Fixed wing multi engine,BOEING,737-8H4,2,140,NaN,Turbo-fan

### 17

In [70]:
query = r"SELECT * FROM planes WHERE year >= 2012 ORDER BY seats, year"
sql_query = pd.read_sql(query, con)
sql_query.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,1564,N537JB,2012.0,Rotorcraft,ROBINSON HELICOPTER CO,R66,1,5,None,Turbo-shaft
1,837,N353JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
2,825,N351JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
3,815,N348JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan
4,859,N358JB,2013.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,None,Turbo-fan

In [71]:
result = planes[planes["year"] >= 2012].sort_values(by=["seats", "year"]).reset_index()
result.head()

,index,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,1564,N537JB,2012.0,Rotorcraft,ROBINSON HELICOPTER CO,R66,1,5,NaN,Turbo-shaft
1,815,N348JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
2,825,N351JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
3,837,N353JB,2012.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan
4,843,N354JB,2013.0,Fixed wing multi engine,EMBRAER,ERJ 190-100 IGW,2,20,NaN,Turbo-fan

### 18
#### Wybierz 100 losowych wierszy z airports,

In [72]:
result = airports.sample(n=100)
result.shape

(100, 8)

### 19
#### Wybierz 5% losowych wierszy

In [74]:
print(airports.shape)
result = airports.sample(frac=0.05)
result.shape

(1458, 8)

(73, 8)

### 20
#### Wybierz pierwszych 100 wierszy

In [77]:
airports.head(100).shape

(100, 8)

### 21 
#### Wybierz ostatnich 100 wierszy

In [78]:
airports.head(100).shape

(100, 8)

## Niech:
## A - wiersze 1,...,10 z airports,
## B - wiersze 6,..., 15 z airports.

In [84]:
A = airports[1:11]
B = airports[5:16]

### 1 SELECT * FROM A UNION SELECT * FROM B

In [86]:
pd.concat([A, B]).drop_duplicates()

,faa,name,lat,lon,alt,tz,dst,tzone
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523,-5,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11,-5,A,America/New_York
5,0A9,Elizabethton Municipal Airport,36.371222,-82.173417,1593,-5,A,America/New_York
6,0G6,Williams County Airport,41.467306,-84.506778,730,-5,A,America/New_York
7,0G7,Finger Lakes Regional Airport,42.883565,-76.781232,492,-5,A,America/New_York
8,0P2,Shoestring Aviation Airfield,39.794824,-76.647191,1000,-5,U,America/New_York
9,0S9,Jefferson County Intl,48.053809,-122.810644,108,-8,A,America/Los_Angeles
10,0W3,Harford County Airport,39.566838,-76.202403,409,-5,A,America/New_York
11,10C,Galt Field Airport,42.402889,-88.375111,875,-6,U,America/Chicago
12,17G,Port Bucyrus-Crawford County Airport,40.781556,-82.974806,1003,-5,A,America/New_York
13,19A,Jackson County Airport,34.175864,-83.561597,951,-5,U,America/New_York
14,1A3,Martin Campbell Field Airport,35.015806,-84.346833,1789,-5,A,America/New_York
15,1B9,Mansfield Municipal,42.000133,-71.196771,122,-5,A,America/New_York

### 2 SELECT * FROM A UNION ALL SELECT * FROM B

In [87]:
pd.concat([A, B])

,faa,name,lat,lon,alt,tz,dst,tzone
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523,-5,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11,-5,A,America/New_York
5,0A9,Elizabethton Municipal Airport,36.371222,-82.173417,1593,-5,A,America/New_York
6,0G6,Williams County Airport,41.467306,-84.506778,730,-5,A,America/New_York
7,0G7,Finger Lakes Regional Airport,42.883565,-76.781232,492,-5,A,America/New_York
8,0P2,Shoestring Aviation Airfield,39.794824,-76.647191,1000,-5,U,America/New_York
9,0S9,Jefferson County Intl,48.053809,-122.810644,108,-8,A,America/Los_Angeles
10,0W3,Harford County Airport,39.566838,-76.202403,409,-5,A,America/New_York
5,0A9,Elizabethton Municipal Airport,36.371222,-82.173417,1593,-5,A,America/New_York
6,0G6,Williams County Airport,41.467306,-84.506778,730,-5,A,America/New_York
7,0G7,Finger Lakes Regional Airport,42.883565,-76.781232,492,-5,A,America/New_York
8,0P2,Shoestring Aviation Airfield,39.794824,-76.647191,1000,-5,U,America/New_York
9,0S9,Jefferson County Intl,48.053809,-122.810644,108,-8,A,America/Los_Angeles
10,0W3,Harford County Airport,39.566838,-76.202403,409,-5,A,America/New_York
11,10C,Galt Field Airport,42.402889,-88.375111,875,-6,U,America/Chicago
12,17G,Port Bucyrus-Crawford County Airport,40.781556,-82.974806,1003,-5,A,America/New_York
13,19A,Jackson County Airport,34.175864,-83.561597,951,-5,U,America/New_York
14,1A3,Martin Campbell Field Airport,35.015806,-84.346833,1789,-5,A,America/New_York
15,1B9,Mansfield Municipal,42.000133,-71.196771,122,-5,A,America/New_York

### 3 SELECT * FROM A INTERSECT SELECT * FROM B

In [90]:
A[A.isin(B)].dropna()

,faa,name,lat,lon,alt,tz,dst,tzone
5,0A9,Elizabethton Municipal Airport,36.371222,-82.173417,1593.0,-5.0,A,America/New_York
6,0G6,Williams County Airport,41.467306,-84.506778,730.0,-5.0,A,America/New_York
7,0G7,Finger Lakes Regional Airport,42.883565,-76.781232,492.0,-5.0,A,America/New_York
8,0P2,Shoestring Aviation Airfield,39.794824,-76.647191,1000.0,-5.0,U,America/New_York
9,0S9,Jefferson County Intl,48.053809,-122.810644,108.0,-8.0,A,America/Los_Angeles
10,0W3,Harford County Airport,39.566838,-76.202403,409.0,-5.0,A,America/New_York

### 4 SELECT * FROM A EXCEPT SELECT * FROM B

In [93]:
A[~A.isin(B)].dropna()

,faa,name,lat,lon,alt,tz,dst,tzone
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264.0,-6.0,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801.0,-6.0,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523.0,-5.0,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11.0,-5.0,A,America/New_York

### 5 SELECT * FROM B EXCEPT SELECT * FROM A

In [94]:
B[~B.isin(A)].dropna()

,faa,name,lat,lon,alt,tz,dst,tzone
11,10C,Galt Field Airport,42.402889,-88.375111,875.0,-6.0,U,America/Chicago
12,17G,Port Bucyrus-Crawford County Airport,40.781556,-82.974806,1003.0,-5.0,A,America/New_York
13,19A,Jackson County Airport,34.175864,-83.561597,951.0,-5.0,U,America/New_York
14,1A3,Martin Campbell Field Airport,35.015806,-84.346833,1789.0,-5.0,A,America/New_York
15,1B9,Mansfield Municipal,42.000133,-71.196771,122.0,-5.0,A,America/New_York

## Dokonaj bazodanowej operacji join

### 1 Złącz flights z planes

In [95]:
result = pd.merge(flights, planes)
result.shape

(4630, 24)

### 2 Złącz flights z weather, planes i airlines

In [101]:
flights.head()

,Unnamed: 0,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,1,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,3,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,4,2013,1,1,544.0,-1.0,1004.0,-18.0,B6,N804JB,725,JFK,BQN,183.0,1576,5.0,44.0
4,5,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0

In [97]:
weather.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,0,37.04,21.92,53.97,230.0,10.35702,11.918651,0.0,1013.9,10.0,2013-01-01 01:00:00
1,EWR,2013,1,1,1,37.04,21.92,53.97,230.0,13.80936,15.891535,0.0,1013.0,10.0,2013-01-01 02:00:00
2,EWR,2013,1,1,2,37.94,21.92,52.09,230.0,12.65858,14.567241,0.0,1012.6,10.0,2013-01-01 03:00:00
3,EWR,2013,1,1,3,37.94,23.00,54.51,230.0,13.80936,15.891535,0.0,1012.7,10.0,2013-01-01 04:00:00
4,EWR,2013,1,1,4,37.94,24.08,57.04,240.0,14.96014,17.215830,0.0,1012.8,10.0,2013-01-01 05:00:00

In [99]:
planes.head()

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan

In [106]:
airlines.head()

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

In [105]:
result = pd.merge(pd.merge(pd.merge(flights, weather), planes), airlines)

In [108]:
result.shape

(4574, 35)